Домашнее задание к занятию 1 «Базы данных, их типы» - `Эсадов Роман`
---
### Задание 1. СУБД
1.1. Бюджетирование проектов с дальнейшим формированием финансовых аналитических отчётов и прогнозирования рисков. СУБД должна гарантировать целостность и чёткую структуру данных.
Ответ: Реляционная БД. Так как в реляционной БД данные хранятся в форме таблиц это гарантирует высокий уровень структурированности с жесткими логическими взаимосвязями, минимальный уровень избыточности данных, их согласованность и целостность.
1.2. Под каждый девелоперский проект создаётся отдельный лендинг, и все данные по лидам стекаются в CRM к маркетологам и менеджерам по продажам. Какой тип СУБД лучше использовать для лендингов и для CRM? СУБД должны быть гибкими и быстрыми.
Ответ: БД типа Ключ-Значение. иммено для баз такого типа характерны гибкость и быстрота, т.к. они основаны на простой структуре с одной таблицей, засчет чего не требуется проводить операции объединения разных таблиц.
1.3. Отдел контроля качества решил создать базу по корпоративным нормам и правилам, обучающему материалу и так далее, сформированную согласно структуре компании. СУБД должна иметь простую и понятную структуру.
Ответ: Иерархическая БД. База имеет простую, древовидную структру с четкой моделью подчиенности оъектов от родителя к потомку.
1.4. Департамент логистики нуждается в решении задач по быстрому формированию маршрутов доставки материалов по объектам и распределению курьеров по маршрутам с доставкой документов. СУБД должна уметь быстро работать со связями.
Ответ: Графовая БД. Засчет связей ребра-вершины, обход данных происходит намного быстрее чем поиск данных внутри структуриорванных таблиц. 
---
### Задание 2. Транзакции
2.1. Пользователь пополняет баланс счёта телефона, распишите пошагово, какие действия должны произойти для того, чтобы транзакция завершилась успешно. Ориентируйтесь на шесть действий.
Старт транзакции
* Проверка баланса карты пользователя
* Списание суммы пополнения с карты пользователя
* Сохранение измененного баланса карты пользователя
* Проверка баланса счета телефона пользователя
* Увелечиение счета пользователя на сумму пополенения
* Сохранение измененного баланса счета телефона пользователя
Завершение транзакции
---
### Задание 3. SQL vs NoSQL
3.1. Напишите пять преимуществ SQL-систем по отношению к NoSQL.
1. Стандартизированный изык работы с данными
2. Пользователям проще работать с данными из-за заранее определенной структуры данных (Схемы, таблицы и т.д.)
3. Обеспечивает целостность огромного количества данных, нарпимер для финансовой сферы
4. Обеспечивает разграничение доступа к данным на разных уровнях (Привелегии пользователей)
5. Реляционная модель данных поддерживается больше других, в следствие чего имеет более проработанную базу теории и ее реализации.
---
Задание 4. Кластеры
Необходимо производить большое количество вычислений при работе с огромным количеством данных, под эту задачу выделено 1000 машин.
На основе какого критерия будете выбирать тип СУБД и какая модель распределённых вычислений здесь справится лучше всего и почему?

---
